/*#include <stdio.h>

int main(void)
{
	// 다차원 배열 Multidimensional Array
	int j;

	int arr[5];

	int arr2[2][5];

	int arr3[4][2];

	int arr4[3][3][3];

	// 다차원 배열 선언
	int arr5[5] = { 1,2,3,4,5 };

	int arr6[2][5] = {
		{ 1,2,3,4,5 },
		{ 1,2,3,4,5 }
	};

	int arr7[4][2] = {
		{1,2},
		{1,2},
		{1,2},
		{1,2}
	};

	int arr8[3][3][3] = {
		{
			{1, 2, 3},
			{1, 2, 3},
			{1, 2, 3}
		},
		{
			{1, 2, 3},
			{1, 2, 3},
			{1, 2, 3}
		},
		{
			{1, 2, 3},
			{1, 2, 3},
			{1, 2, 3}
		}
	};

	// 다차원 배열 사용
	int arr9[4][2] = {
		{1,2},
		{3,4},
		{5,6},
		{7,8}
	};

	for (int i = 0; i < 4; i++)
	{
		for (int j = 0; j < 2; j++)
		{
			printf("2차원배열 (%d, %d) 의 값 : %d\n", i, j, arr9[i][j]);
		}
		printf("\n\n");
	}

	int arr10[3][3][3] = {
		{
			{1, 2, 3},
			{4, 5, 6},
			{7, 8, 9}
		},
		{
			{11, 12, 13},
			{14, 15, 16},
			{17, 18, 19}
		},
		{
			{21, 22, 23},
			{24, 25, 26},
			{27, 28, 29}
		}
	};

	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			for (int k = 0; k < 3; k++)
			{
				printf("3차원배열 (&d, &d, %d) 의 값 : %d\n", i, j, k, arr10[i][j][k]);
			}
			printf("\n\n");
		}
		printf("\n\n");
	}

	return 0;
}*/